export default  {
  noEmptyReg: [/[\S]+/, "必填项不能为空"], //非空
  acsiiReg: [/^[\x00-\xFF]+$/, "只能输入ACSII字符"], //仅ACSII字符
  numberReg: [/^([+-]?)\d*\.?\d+$/, "只能输入纯数字"], //纯数字，不能包含任何非数字
  integerReg: [/^-?[1-9]\d*$/, "只能输入正负整数"], //正负整数
  negativeIntReg: [/^-[1-9]\d*$/, "只能输入负整数"], //负整数
  positiveIntReg: [/^[0-9]\d*$/, "只能输入正整数"], //正整数
  floatReg: [/^-?(([1-9]\d+|\d)(\.\d{1,})?)$/, "只能输入正负浮点数"], //正负浮点数
  negativeFloatReg: [/^-(([1-9]\d+|\d)(\.\d{1,})?)$/, "只能输入负浮点数"], //负浮点数
  positiveFloatReg: [/^([1-9]\d+|\d)(\.\d{1,})?$/, "只能输入正浮点数"], //正浮点数
  alphabetReg: [/^[A-Za-z]+$/, "只能输入大小写字母"], //大小写字母
  LETTERReg: [/^[A-Z]+$/, "只能输入大写字母"], //大写字母
  letterReg: [/^[a-z]+$/, "只能输入小写字母"], //小写字母
  chineseReg: [/^[\u4e00-\u9fa5]+$/, "只能输入中文"], //中文
  colorReg: [/^#[a-fA-F0-9]{6}$/, "只能输入16进制色值"], //16进制色值
  dateReg: [/^\d{4}(\-|\/|.)\d{1,2}\1\d{1,2}$/, "日期格式不正确"], //日期
  usernameReg: [/^[A-Za-z0-9_\-\u4e00-\u9fa5]+$/, "用户名"], //用户名
  passwordReg: [/^[A-Za-z0-9_-]{8,38}$/, "密码不能为空或格式不正确"], //密码
  trueNameReg: [/^[A-Za-z0-9\u4e00-\u9fa5]+$/, "请输入真实姓名"], //真实姓名
  tellphoneReg: [/^1[3-9]{1}\d{9}$/, "手机号格式不正确"], //手机号码
  phoneNumberReg: [
    /^(0[0-9]{2,3}\-)?([2-9][0-9]{6,7})+(\-[0-9]{1,4})?$/,
    "区号格式不正确"
  ], //包括验证国内区号
  emailReg: [
    /\w+((-w+)|(\.\w+))*\@[A-Za-z0-9]+((\.|-)[A-Za-z0-9]+)*\.[A-Za-z0-9]+/,
    "邮箱格式不正确"
  ], //邮箱
  qqReg: [/^[1-9]*[1-9][0-9]*$/, "QQ号格式不正确"], //QQ
  IDcardReg_a: [/^(\d{6})()?(\d{2})(\d{2})(\d{2})(\d{3})$/, "请输入15位身份证"], //验证身份证15位
  IDcardReg_b: [
    /^(\d{6})()?(\d{4})(\d{2})(\d{2})(\d{3})([0-9xX])$/,
    "请输入18位身份证"
  ], //验证身份证18位
  IdentityCardReg: [
    /^(^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$)|(^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])((\d{4})|\d{3}[Xx])$)$/,
    "请输入15或18位身份证"
  ], //验证身份证
  IPReg: [
    /((?:(?:25[0-5]|2[0-4]\d|[01]?\d?\d)\.){3}(?:25[0-5]|2[0-4]\d|[01]?\d?\d))/,
    "IP地址格式不正确"
  ], //IP地址
  postCodeReg: [/^[1-9][0-9]{5}$/, "邮政编码格式不正确"], //邮政编码
  imgReg: [
    /(.*)\.(jpg|bmp|gif|ico|pcx|jpeg|tif|png|raw|tga)$/,
    "图片格式不正确"
  ], //判断图片
  fileReg: [/(.*)\.(rar|zip|7zip|tgz)$/, "压缩格式不正确"], //判断压缩文件
  siteReg: [/[a-zA-z]+:\/\/[^\s]+/, "网址格式不正确"], //网址,
  ftpReg: [/ftp\:\/\/[^:]*:@([^\/]*)/, "FTP地址格式不正确"], //FTP地址
  passportReg: [/^[0-9]{9}$/, "护照号码格式不正确"], //验证护照号码
  ccvReg: [/^[0-9]{3}$/, "CCV格式不正确"], //验证CCV
  creditCardReg: [/^(4\\d{12}(?:\\d{3})?)$/, "信用卡格式不正确"], //验证信用卡
  creditCardUSAReg: [/^[3-6]\d{14,15}$/, "美国信用卡格式不正确"], //验证美国信用卡
  postCodeUSAReg: [/^\d{5}$|^\d{9}$/, "国邮政编码卡格式不正确"], //验证美国邮政编码
  Url: [
    /^http:\/\/[A-Za-z0-9]+\.[A-Za-z0-9]+[\/=\?%\-&_~`@[\]\':+!]*([^<>\"\"])*$/,
    "URL格式不正确"
  ], //URL
  options: [/^(?=.*\S+)((?!请选择).)*$/, "请选择一个"] //select选项框
};